{
   "allow_add_mods" : true,
   "custom_icons" : false,
   "description" : "An AI Racing System that connects to any creation!\nOUTDATED FOR NOW\n[h1]Introduction[/h1]\nHave you ever wanted to race against your own creations but have no one to race with?\nNow you can! With this racing system, you can make any creation race around any specially designed track!\nWith a relatively simple setup and no extra downloads needed, you can now race against as many ai cars as you want!\n\n[b]WARNING:[/b] This is a Beta: things might go wrong and may cause your game to lag or cars to malfunction. Please report all bugs and issues. This mod is also constantly updating, check out the change notes to see added features and fixes!\n\n[h1]Instructions[/h1]\n[b]Track Setup:[/b][olist]\n[*]Build or download SMAR compatible tracks (see video tutorial)\n[*]Place Track tile in a world.\n[*]Go to the start/finish line of the track and place down the Track Scanner. (cross hair/target should be facing the direction you want cars to go)\n[*]Make Sure track is empty and Press 'E' on scanner\n[*]Wait for scan to complete [moving outside of track walls recommended]. \n[*]If message, \"Scan Complete: Track Saved\"  inspect racing line, If something looks wrong or error displayed, feel free to notify me. (Moving the scanning block may fix some errors)[/olist]\nNote: Once track is saved, it is saved to the current world permanently until overwritten. (This means you can delete block after scan completion) Cross world & scan sharing is coming soon\n\n[b]Car Setup:[/b][olist]\n[*] Place down any car  & disconnect all bearings from engine and seat\n[*] Place SMAR Driver block on creation. ENSURE SIDE WITH STEERING WHEEL IS FACING FRONT OF THE CAR AND RIGHT SIDE UP (Arrow up) \n[*] Place SMAR Engine block on creation\n[*] Connect SMAR engine and driver blocks to respective bearings on creation. Same as driver seat & engine connections\n[*] Connect driver block to the engine block[/olist]\n\n[b]Race Setup:[/b][olist]\n[*] Place SMAR Race control anywhere in world\n[*] Connect switch logic input to Race Control\n[*] Turn switch on and racers will begin to ",
   "fileId" : 2491894529,
   "localId" : "5411dc77-fa28-4c61-af84-bcb1415e3476",
   "name" : "SM Auto Racers",
   "type" : "Blocks and Parts",
   "version" : 1
}
