{
   "allow_add_mods" : true,
   "custom_icons" : false,
   "description" : "An AI Racing System that connects to any creation!\r\nVersion 1.8.39 - Updated 11/25/2024\r\n\r\n[h1]Introduction[/h1]\r\nHave you ever wanted to race against your own creations but have no one to race with?\r\nNow you can! With this racing system, you can make any creation race around any specially designed track!\r\nWith a relatively simple setup and no extra downloads needed, you can now race against as many ai cars as you want!\r\n\r\n[b]WARNING:[/b] This is a Beta: things might go wrong and may cause your game to lag or cars to malfunction. Please report all bugs and issues. This mod is also constantly updating, check out the change notes to see added features and fixes!\r\n\r\n[h1]Instructions[/h1]\r\n[b]Track Setup:[/b][olist]\r\n[*]Build or download SMAR compatible tracks (see video tutorial)\r\n[*]Place Track tile in a world.\r\n[*]Go to the start/finish line of the track and place down the Track Scanner. (cross hair/target should be facing the direction you want cars to go)\r\n[*]Make Sure track is empty and Press 'E' on scanner\r\n[*]Wait for scan to complete [moving outside of track walls recommended]. \r\n[*]If message, \"Scan Complete: Track Saved\"  inspect racing line, If something looks wrong or error displayed, feel free to notify me. (Moving the scanning block may fix some errors)[/olist]\r\nNote: Once track is saved, it is saved to the current world permanently until overwritten. (This means you can delete block after scan completion) Cross world & scan sharing is coming soon\r\n\r\n[b]Car Setup:[/b][olist]\r\n[*] Place down any car  & disconnect all bearings from engine and seat\r\n[*] Place SMAR Driver block on creation. ENSURE SIDE WITH STEERING WHEEL IS FACING FRONT OF THE CAR AND RIGHT SIDE UP (Arrow up) \r\n[*] Place SMAR Engine block on creation\r\n[*] Connect SMAR engine and driver blocks to respective bearings on creation. Same as driver seat & engine connections\r\n[*] Connect driver block to the engine block[/olist]\r\n\r\n[b]Race Setup:[/b][olist]\r\n[*] Place SMAR Race control anywhere in world\r\n[*] Grab and press \"Q\" on the Race Control Tool\r\n[*] Click on the green square to begin the race![/olist]\r\nNote: Interact With Race control interface to open a rough UI that allows you to view race status and change various race settings before or mid race.\r\nResetting the race will restart race completely. You can reset via race control interface or by clicking the red box in the race control tool after a race is finished\r\n\r\nPlease Report any issues in the Bug Report Discussion Forum\r\n[hr][/hr]\r\n\r\n[h1]Features[/h1] \r\n[b]Engine Color Code:[/b]\r\nBlack to white: slowest to fastest\r\n-[b]Black:[/b] Slow; same top speed as gas engine (default)\r\n-[b]Dark Gray:[/b]  Intermediate; slightly faster than gas engine\r\n-[b]Light Gray:[/b] Fast; cars begin to lose control exiting corners if not built properly (suspension/COM/steering)\r\n-[b]White:[/b] Very fast; Good for straight lines but likely to fishtail out of corners\r\n\r\n[b]Race Control Interface:[/b]\r\nInteract with race control terminal to view interface\r\n-[b]Draft Strength:[/b] How strong the slipstream effect is, Setting to 0 will disable drafting\r\n-[b]Laps[/b]: Number of laps in race. Once a car wins, all cars who cross line after will finish as well.\r\n-[b]Handicap Multiplier:[/b] How fast cars behind leader catch up. Similar to Mario kart [0 will disable handicap] [default  recommended]\r\n\r\n[b](Beta) User Control:[/b] Connect any driving seat to the SMAR Driver block: Press 1 toggle human control!\r\n\r\n[b]SMAR Race Control Tool[/b]\r\n- Press 'q' to open a very crude GUI that will let you set the race flags of Red, Yellow and Green\r\n- Current Race status is also shown\r\n\r\n[b]Race Status Logic Output [/b]\r\n- Connect driver block to a vanilla logic gate\r\n- Driver will output 1, true, on, etc. whenever the racing flag is green and 0, false, off, etc. when flag is not green\r\n\r\n[b]Extras:[/b][list]\r\n[*]View Debug information for a driver by pressing 'E' on the Driver block\r\n[*]Crouch and press E on Track scanner to toggle racing  line effects\r\n[*]Interact with the Race Control terminal to customize drafting, number of laps, and handicap (More coming soon)\r\n[*]Upon race completion, Each car now sends to chat what place and their split from the leader\r\n[*] If Drivers are lost for too long, they will get \"reset\" automatically either at their last known location or at the beginning of the lap. \r\n[/list]\r\n\r\n[h1] Pre-built Tracks & Cars[/h1]\r\nIn the event you do not want to create your own tracks feel free to use my own or ones that others have made.\r\nsearch \"SMAR official\"  or check out the SMAR Official Collection for tracks, cars, and more!\r\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2588724119\r\n\r\n[b]Upcoming Features[/b]:\r\n- Custom engine Controls\r\n- Custom behavior controls",
   "fileId" : 2491894529,
   "localId" : "5411dc77-fa28-4c61-af84-bcb1415e3476",
   "name" : "SM Auto Racers",
   "type" : "Blocks and Parts",
   "version" : 1
}
